// Generated by jextract

package dev.elide.transport.bridge;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct sf_hdtr {
 *     struct iovec *headers;
 *     int hdr_cnt;
 *     struct iovec *trailers;
 *     int trl_cnt;
 * }
 * }
 */
public class sf_hdtr {

    sf_hdtr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        netty_unix_socket_h.C_POINTER.withName("headers"),
        netty_unix_socket_h.C_INT.withName("hdr_cnt"),
        MemoryLayout.paddingLayout(4),
        netty_unix_socket_h.C_POINTER.withName("trailers"),
        netty_unix_socket_h.C_INT.withName("trl_cnt"),
        MemoryLayout.paddingLayout(4)
    ).withName("sf_hdtr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout headers$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("headers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct iovec *headers
     * }
     */
    public static final AddressLayout headers$layout() {
        return headers$LAYOUT;
    }

    private static final long headers$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct iovec *headers
     * }
     */
    public static final long headers$offset() {
        return headers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct iovec *headers
     * }
     */
    public static MemorySegment headers(MemorySegment struct) {
        return struct.get(headers$LAYOUT, headers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct iovec *headers
     * }
     */
    public static void headers(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(headers$LAYOUT, headers$OFFSET, fieldValue);
    }

    private static final OfInt hdr_cnt$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hdr_cnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hdr_cnt
     * }
     */
    public static final OfInt hdr_cnt$layout() {
        return hdr_cnt$LAYOUT;
    }

    private static final long hdr_cnt$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hdr_cnt
     * }
     */
    public static final long hdr_cnt$offset() {
        return hdr_cnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hdr_cnt
     * }
     */
    public static int hdr_cnt(MemorySegment struct) {
        return struct.get(hdr_cnt$LAYOUT, hdr_cnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hdr_cnt
     * }
     */
    public static void hdr_cnt(MemorySegment struct, int fieldValue) {
        struct.set(hdr_cnt$LAYOUT, hdr_cnt$OFFSET, fieldValue);
    }

    private static final AddressLayout trailers$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("trailers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct iovec *trailers
     * }
     */
    public static final AddressLayout trailers$layout() {
        return trailers$LAYOUT;
    }

    private static final long trailers$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct iovec *trailers
     * }
     */
    public static final long trailers$offset() {
        return trailers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct iovec *trailers
     * }
     */
    public static MemorySegment trailers(MemorySegment struct) {
        return struct.get(trailers$LAYOUT, trailers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct iovec *trailers
     * }
     */
    public static void trailers(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(trailers$LAYOUT, trailers$OFFSET, fieldValue);
    }

    private static final OfInt trl_cnt$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trl_cnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int trl_cnt
     * }
     */
    public static final OfInt trl_cnt$layout() {
        return trl_cnt$LAYOUT;
    }

    private static final long trl_cnt$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int trl_cnt
     * }
     */
    public static final long trl_cnt$offset() {
        return trl_cnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int trl_cnt
     * }
     */
    public static int trl_cnt(MemorySegment struct) {
        return struct.get(trl_cnt$LAYOUT, trl_cnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int trl_cnt
     * }
     */
    public static void trl_cnt(MemorySegment struct, int fieldValue) {
        struct.set(trl_cnt$LAYOUT, trl_cnt$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

